swe-modified-2025/OpenFOAM-tests/Fig1_Openfoam_accuracy/Dambreak-2D-Ny320/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (100 0 0)
    (0 2 0)
    (100 2 0)
    (0 0 0.025)
    (100 0 0.025)
    (0 2 0.025)
    (100 2 0.025)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (4000 320 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 6 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }
);


// ************************************************************************* //
