swe-modified-2025/OpenFOAM-tests/Fig1_Openfoam_accuracy/Dambreak-2D-Ny320/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue tracer.water 0
    volScalarFieldValue tracer.air 0
);

regions
(
    boxToCell
    {
        box (-30 0 -1) (50 1.5 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    boxToCell
    {
	box (50 0 -1) (120 1 1);
	fieldValues
	(
	    volScalarFieldValue alpha.water 1
	);
    }
    boxToCell
    {
        box (-30 0 -1) (50 1.5 1);
        fieldValues
        (
            volScalarFieldValue tracer.water 1
        );
    }
);


// ************************************************************************* //
